---
type: UIView
namespace: Autodesk.Revit.UI
version: 2024
members: 10
tags: [revit-api, class]
---

# UIView

`Autodesk.Revit.UI.UIView` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Close | 2013 | `public void Close ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetWindowRectangle | 2013 | `public Rectangle GetWindowRectangle ()` |
| Method | GetZoomCorners | 2013 | `public IList < XYZ > GetZoomCorners ()` |
| Method | Zoom | 2013 | `public void Zoom ( double zoomFactor )` |
| Method | ZoomAndCenterRectangle | 2013 | `public void ZoomAndCenterRectangle ( XYZ viewCorner1 , XYZ viewCorner2 )` |
| Method | ZoomSheetSize | 2013 | `public void ZoomSheetSize ()` |
| Method | ZoomToFit | 2013 | `public void ZoomToFit ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ViewId | 2013 | `public ElementId ViewId { get ; }` |